<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/cc277dfe-10a5-40be-8e5f-732fd496655a/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:62" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 61 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore.aws_docdb_cluster.docdb will be created
  + resource "aws_docdb_cluster" "docdb" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "prod-keyserver-keystore-primary-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"
      + deletion_protection             = true
      + enabled_cloudwatch_logs_exports = [
          + "audit",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = "arn:aws:kms:eu-central-1:898587786287:key/8807d3bb-5005-48c3-bc18-fe5c1a8a7279"
      + master_password                 = (sensitive value)
      + master_username                 = "keyserver"
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags_all                        = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.keystore.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = (known after apply)
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "staging-keyserver-keystore-docdb-primary-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r6g.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 0
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

  # module.keystore.aws_docdb_subnet_group.private_subnets will be created
  + resource "aws_docdb_subnet_group" "private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0851c91f1a82ece18",
          + "subnet-0f59998ee3eeb6b29",
          + "subnet-0fe665bde6c07d332",
        ]
      + tags_all    = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.keystore.aws_secretsmanager_secret.master_password will be created
  + resource "aws_secretsmanager_secret" "master_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "staging-keyserver-keystore-docdb-master-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.keystore.aws_secretsmanager_secret_version.master_password will be created
  + resource "aws_secretsmanager_secret_version" "master_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.keystore.aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "staging-keyserver-keystore-docdb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-08d4ffa8940e11aa5"
    }

  # module.keystore.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.keystore_docdb.aws_docdb_cluster.docdb_primary will be destroyed
  # (because aws_docdb_cluster.docdb_primary is not in configuration)
  - resource "aws_docdb_cluster" "docdb_primary" {
      - arn                             = "arn:aws:rds:eu-central-1:898587786287:cluster:staging-keyserver-keystore-docdb-primary-cluster" -> null
      - availability_zones              = [
          - "eu-central-1a",
          - "eu-central-1b",
          - "eu-central-1c",
        ] -> null
      - backup_retention_period         = 1 -> null
      - cluster_identifier              = "staging-keyserver-keystore-docdb-primary-cluster" -> null
      - cluster_members                 = [
          - "staging-keyserver-keystore-docdb-primary-instance-0",
        ] -> null
      - cluster_resource_id             = "cluster-IHQNJWC63NKRELS7LEYFYOE5KE" -> null
      - db_cluster_parameter_group_name = "default.docdb5.0" -> null
      - db_subnet_group_name            = "staging-keyserver-keystore-docdb-private-subnet-group" -> null
      - deletion_protection             = false -> null
      - enabled_cloudwatch_logs_exports = [
          - "audit",
        ] -> null
      - endpoint                        = "staging-keyserver-keystore-docdb-primary-cluster.cluster-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null
      - engine                          = "docdb" -> null
      - engine_version                  = "5.0.0" -> null
      - hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> null
      - id                              = "staging-keyserver-keystore-docdb-primary-cluster" -> null
      - kms_key_id                      = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null
      - master_password                 = (sensitive value) -> null
      - master_username                 = "keyserver" -> null
      - port                            = 27017 -> null
      - preferred_backup_window         = "22:12-22:42" -> null
      - preferred_maintenance_window    = "sat:21:17-sat:21:47" -> null
      - reader_endpoint                 = "staging-keyserver-keystore-docdb-primary-cluster.cluster-ro-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null
      - skip_final_snapshot             = true -> null
      - storage_encrypted               = true -> null
      - tags                            = {} -> null
      - tags_all                        = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_security_group_ids          = [
          - "sg-01de29cd9149d5d29",
        ] -> null
    }

  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be destroyed
  # (because aws_docdb_cluster_instance.docdb_instances is not in configuration)
  - resource "aws_docdb_cluster_instance" "docdb_instances" {
      - arn                          = "arn:aws:rds:eu-central-1:898587786287:db:staging-keyserver-keystore-docdb-primary-instance-0" -> null
      - auto_minor_version_upgrade   = true -> null
      - availability_zone            = "eu-central-1c" -> null
      - ca_cert_identifier           = "rds-ca-2019" -> null
      - cluster_identifier           = "staging-keyserver-keystore-docdb-primary-cluster" -> null
      - db_subnet_group_name         = "staging-keyserver-keystore-docdb-private-subnet-group" -> null
      - dbi_resource_id              = "db-GF34S7DWNQQBQUS4WCMKJKNQSA" -> null
      - endpoint                     = "staging-keyserver-keystore-docdb-primary-instance-0.cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null
      - engine                       = "docdb" -> null
      - engine_version               = "5.0.0" -> null
      - id                           = "staging-keyserver-keystore-docdb-primary-instance-0" -> null
      - identifier                   = "staging-keyserver-keystore-docdb-primary-instance-0" -> null
      - instance_class               = "db.r6g.large" -> null
      - kms_key_id                   = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null
      - port                         = 27017 -> null
      - preferred_backup_window      = "22:12-22:42" -> null
      - preferred_maintenance_window = "fri:02:49-fri:03:19" -> null
      - promotion_tier               = 0 -> null
      - publicly_accessible          = false -> null
      - storage_encrypted            = true -> null
      - tags                         = {} -> null
      - tags_all                     = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - writer                       = true -> null
    }

  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be destroyed
  # (because aws_docdb_subnet_group.private_subnets is not in configuration)
  - resource "aws_docdb_subnet_group" "private_subnets" {
      - arn         = "arn:aws:rds:eu-central-1:898587786287:subgrp:staging-keyserver-keystore-docdb-private-subnet-group" -> null
      - description = "Managed by Terraform" -> null
      - id          = "staging-keyserver-keystore-docdb-private-subnet-group" -> null
      - name        = "staging-keyserver-keystore-docdb-private-subnet-group" -> null
      - subnet_ids  = [
          - "subnet-0851c91f1a82ece18",
          - "subnet-0f59998ee3eeb6b29",
          - "subnet-0fe665bde6c07d332",
        ] -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.aws_kms_key.docdb_encryption will be destroyed
  # (because aws_kms_key.docdb_encryption is not in configuration)
  - resource "aws_kms_key" "docdb_encryption" {
      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null
      - is_enabled                         = true -> null
      - key_id                             = "49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::898587786287:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.aws_secretsmanager_secret.master_password will be destroyed
  # (because aws_secretsmanager_secret.master_password is not in configuration)
  - resource "aws_secretsmanager_secret" "master_password" {
      - arn                            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null
      - name                           = "staging-keyserver-keystore-docdb-master-password" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.aws_secretsmanager_secret_version.master_password will be destroyed
  # (because aws_secretsmanager_secret_version.master_password is not in configuration)
  - resource "aws_secretsmanager_secret_version" "master_password" {
      - arn            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null
      - id             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj|C675B0DF-31BB-43CE-AD7A-E7C161999EAB" -> null
      - secret_id      = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "C675B0DF-31BB-43CE-AD7A-E7C161999EAB" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.keystore_docdb.aws_security_group.service_security_group will be destroyed
  # (because aws_security_group.service_security_group is not in configuration)
  - resource "aws_security_group" "service_security_group" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01de29cd9149d5d29" -> null
      - description            = "Allow ingress from the application" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow outbound traffic from the DocDB cluster"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-01de29cd9149d5d29" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow inbound traffic to the DocDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
            },
        ] -> null
      - name                   = "staging-keyserver-keystore-docdb-service" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-08d4ffa8940e11aa5" -> null
    }

  # module.keystore_docdb.random_password.master_password will be destroyed
  # (because random_password.master_password is not in configuration)
  - resource "random_password" "master_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.o11y.grafana_dashboard.main will be updated in-place
  ~ resource "grafana_dashboard" "main" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels        = [
                    # (4 unchanged elements hidden)
                    {
                        content     = "# DocumentDB"
                        datasource  = null
                        gridPos     = {
                            h = 4
                            w = 24
                            x = 0
                            y = 16
                        }
                        mode        = "markdown"
                        title       = ""
                        transparent = true
                        type        = "text"
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (10 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (11 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (10 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (12 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-keyserver-keystore-docdb-primary-cluster" -> "module.keystore_docdb.cluster_id"
                                }
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                ]
                tags          = []
                # (19 unchanged attributes hidden)
            }
        )
        id           = "staging-keyserver"
        # (7 unchanged attributes hidden)
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main will be destroyed
  # (because aws_cloudwatch_log_group.main is not in configuration)
  - resource "aws_cloudwatch_log_group" "main" {
      - arn               = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling" -> null
      - id                = "/aws/lambda/staging-keyserver-docdb-autoscaling" -> null
      - name              = "/aws/lambda/staging-keyserver-docdb-autoscaling" -> null
      - retention_in_days = 7 -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.main is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "main" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling",
        ] -> null
      - alarm_name                = "staging-keyserver-docdb-autoscaling-0" -> null
      - arn                       = "arn:aws:cloudwatch:eu-central-1:898587786287:alarm:staging-keyserver-docdb-autoscaling-0" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBClusterIdentifier" = "staging-keyserver-keystore-docdb-primary-cluster"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "staging-keyserver-docdb-autoscaling-0" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CPUUtilization" -> null
      - namespace                 = "AWS/DocDB" -> null
      - ok_actions                = [
          - "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - threshold                 = 80 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_policy.lambda will be destroyed
  # (because aws_iam_policy.lambda is not in configuration)
  - resource "aws_iam_policy" "lambda" {
      - arn       = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - id        = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - name      = "staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling:*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling:*:*"
                    },
                  - {
                      - Action   = [
                          - "rds:DescribeDBInstances",
                          - "rds:DescribeDBClusters",
                          - "rds:CreateDBInstance",
                          - "rds:DeleteDBInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:rds:eu-central-1:898587786287:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA5COABPQXW45SOGJUG" -> null
      - tags      = {} -> null
      - tags_all  = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_role.lambda will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::898587786287:role/staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-08-07T15:13:40Z" -> null
      - force_detach_policies = false -> null
      - id                    = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - unique_id             = "AROA5COABPQXZV7K3BXPB" -> null

      - inline_policy {}
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda will be destroyed
  # (because aws_iam_role_policy_attachment.lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda" {
      - id         = "staging-keyserver-docdb-autoscaling-eu-central-1-role-20230807151343820300000001" -> null
      - policy_arn = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - role       = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be destroyed
  # (because aws_lambda_function.main is not in configuration)
  - resource "aws_lambda_function" "main" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null
      - filename                       = ".terraform/modules/keystore_docdb.docdb-autoscaling/.files/init.zip" -> null
      - function_name                  = "staging-keyserver-docdb-autoscaling" -> null
      - handler                        = "index.handler" -> null
      - id                             = "staging-keyserver-docdb-autoscaling" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling/invocations" -> null
      - last_modified                  = "2023-08-07T15:20:15.243+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::898587786287:role/staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "iG52XIKJxJppt5z7sJPoMUh/OAaeKIZP/W0R0T4h3vQ=" -> null
      - source_code_size               = 1933 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "cluster_identifier" = "staging-keyserver-keystore-docdb-primary-cluster"
              - "max_capacity"       = "6"
              - "min_capacity"       = "0"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_permission.sns will be destroyed
  # (because aws_lambda_permission.sns is not in configuration)
  - resource "aws_lambda_permission" "sns" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null
      - id            = "AllowSubscriptionToSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
      - statement_id  = "AllowSubscriptionToSNS" -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic.main will be destroyed
  # (because aws_sns_topic.main is not in configuration)
  - resource "aws_sns_topic" "main" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "staging-keyserver-docdb-autoscaling" -> null
      - owner                                    = "898587786287" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "898587786287"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main will be destroyed
  # (because aws_sns_topic_subscription.main is not in configuration)
  - resource "aws_sns_topic_subscription" "main" {
      - arn                             = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:3f833700-eec4-4009-9d92-4f94f78d53c8" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:3f833700-eec4-4009-9d92-4f94f78d53c8" -> null
      - owner_id                        = "898587786287" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
    }

Plan: 8 to add, 3 to change, 18 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"%0A        name                               = "staging_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:62" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging_keyserver" -> (known after apply)%0A      ~ revision                 = 61 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore.aws_docdb_cluster.docdb will be created%0A  + resource "aws_docdb_cluster" "docdb" {%0A      + apply_immediately               = (known after apply)%0A      + arn                             = (known after apply)%0A      + availability_zones              = (known after apply)%0A      + backup_retention_period         = 1%0A      + cluster_identifier              = "prod-keyserver-keystore-primary-cluster"%0A      + cluster_identifier_prefix       = (known after apply)%0A      + cluster_members                 = (known after apply)%0A      + cluster_resource_id             = (known after apply)%0A      + db_cluster_parameter_group_name = (known after apply)%0A      + db_subnet_group_name            = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"%0A      + deletion_protection             = true%0A      + enabled_cloudwatch_logs_exports = [%0A          + "audit",%0A        ]%0A      + endpoint                        = (known after apply)%0A      + engine                          = "docdb"%0A      + engine_version                  = (known after apply)%0A      + hosted_zone_id                  = (known after apply)%0A      + id                              = (known after apply)%0A      + kms_key_id                      = "arn:aws:kms:eu-central-1:898587786287:key/8807d3bb-5005-48c3-bc18-fe5c1a8a7279"%0A      + master_password                 = (sensitive value)%0A      + master_username                 = "keyserver"%0A      + port                            = 27017%0A      + preferred_backup_window         = (known after apply)%0A      + preferred_maintenance_window    = (known after apply)%0A      + reader_endpoint                 = (known after apply)%0A      + skip_final_snapshot             = true%0A      + storage_encrypted               = true%0A      + tags_all                        = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + vpc_security_group_ids          = (known after apply)%0A    }%0A%0A  # module.keystore.aws_docdb_cluster_instance.docdb_instances[0] will be created%0A  + resource "aws_docdb_cluster_instance" "docdb_instances" {%0A      + apply_immediately            = (known after apply)%0A      + arn                          = (known after apply)%0A      + auto_minor_version_upgrade   = true%0A      + availability_zone            = (known after apply)%0A      + ca_cert_identifier           = (known after apply)%0A      + cluster_identifier           = (known after apply)%0A      + db_subnet_group_name         = (known after apply)%0A      + dbi_resource_id              = (known after apply)%0A      + endpoint                     = (known after apply)%0A      + engine                       = "docdb"%0A      + engine_version               = (known after apply)%0A      + id                           = (known after apply)%0A      + identifier                   = "staging-keyserver-keystore-docdb-primary-instance-0"%0A      + identifier_prefix            = (known after apply)%0A      + instance_class               = "db.r6g.large"%0A      + kms_key_id                   = (known after apply)%0A      + port                         = (known after apply)%0A      + preferred_backup_window      = (known after apply)%0A      + preferred_maintenance_window = (known after apply)%0A      + promotion_tier               = 0%0A      + publicly_accessible          = (known after apply)%0A      + storage_encrypted            = (known after apply)%0A      + tags_all                     = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + writer                       = (known after apply)%0A    }%0A%0A  # module.keystore.aws_docdb_subnet_group.private_subnets will be created%0A  + resource "aws_docdb_subnet_group" "private_subnets" {%0A      + arn         = (known after apply)%0A      + description = "Managed by Terraform"%0A      + id          = (known after apply)%0A      + name        = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"%0A      + name_prefix = (known after apply)%0A      + subnet_ids  = [%0A          + "subnet-0851c91f1a82ece18",%0A          + "subnet-0f59998ee3eeb6b29",%0A          + "subnet-0fe665bde6c07d332",%0A        ]%0A      + tags_all    = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A    }%0A%0A  # module.keystore.aws_secretsmanager_secret.master_password will be created%0A  + resource "aws_secretsmanager_secret" "master_password" {%0A      + arn                            = (known after apply)%0A      + force_overwrite_replica_secret = false%0A      + id                             = (known after apply)%0A      + name                           = "staging-keyserver-keystore-docdb-master-password"%0A      + name_prefix                    = (known after apply)%0A      + policy                         = (known after apply)%0A      + recovery_window_in_days        = 30%0A      + rotation_enabled               = (known after apply)%0A      + rotation_lambda_arn            = (known after apply)%0A      + tags_all                       = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A    }%0A%0A  # module.keystore.aws_secretsmanager_secret_version.master_password will be created%0A  + resource "aws_secretsmanager_secret_version" "master_password" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + secret_id      = (known after apply)%0A      + secret_string  = (sensitive value)%0A      + version_id     = (known after apply)%0A      + version_stages = (known after apply)%0A    }%0A%0A  # module.keystore.aws_security_group.service_security_group will be created%0A  + resource "aws_security_group" "service_security_group" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow ingress from the application"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.0.0.0/16",%0A                ]%0A              + description      = "Allow outbound traffic from the DocDB cluster"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.0.0.0/16",%0A                ]%0A              + description      = "Allow inbound traffic to the DocDB cluster"%0A              + from_port        = 27017%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 27017%0A            },%0A        ]%0A      + name                   = "staging-keyserver-keystore-docdb"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + vpc_id                 = "vpc-08d4ffa8940e11aa5"%0A    }%0A%0A  # module.keystore.random_password.master_password will be created%0A  + resource "random_password" "master_password" {%0A      + bcrypt_hash = (sensitive value)%0A      + id          = (known after apply)%0A      + length      = 16%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (sensitive value)%0A      + special     = false%0A      + upper       = true%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_cluster.docdb_primary will be destroyed%0A  # (because aws_docdb_cluster.docdb_primary is not in configuration)%0A  - resource "aws_docdb_cluster" "docdb_primary" {%0A      - arn                             = "arn:aws:rds:eu-central-1:898587786287:cluster:staging-keyserver-keystore-docdb-primary-cluster" -> null%0A      - availability_zones              = [%0A          - "eu-central-1a",%0A          - "eu-central-1b",%0A          - "eu-central-1c",%0A        ] -> null%0A      - backup_retention_period         = 1 -> null%0A      - cluster_identifier              = "staging-keyserver-keystore-docdb-primary-cluster" -> null%0A      - cluster_members                 = [%0A          - "staging-keyserver-keystore-docdb-primary-instance-0",%0A        ] -> null%0A      - cluster_resource_id             = "cluster-IHQNJWC63NKRELS7LEYFYOE5KE" -> null%0A      - db_cluster_parameter_group_name = "default.docdb5.0" -> null%0A      - db_subnet_group_name            = "staging-keyserver-keystore-docdb-private-subnet-group" -> null%0A      - deletion_protection             = false -> null%0A      - enabled_cloudwatch_logs_exports = [%0A          - "audit",%0A        ] -> null%0A      - endpoint                        = "staging-keyserver-keystore-docdb-primary-cluster.cluster-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null%0A      - engine                          = "docdb" -> null%0A      - engine_version                  = "5.0.0" -> null%0A      - hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> null%0A      - id                              = "staging-keyserver-keystore-docdb-primary-cluster" -> null%0A      - kms_key_id                      = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null%0A      - master_password                 = (sensitive value) -> null%0A      - master_username                 = "keyserver" -> null%0A      - port                            = 27017 -> null%0A      - preferred_backup_window         = "22:12-22:42" -> null%0A      - preferred_maintenance_window    = "sat:21:17-sat:21:47" -> null%0A      - reader_endpoint                 = "staging-keyserver-keystore-docdb-primary-cluster.cluster-ro-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null%0A      - skip_final_snapshot             = true -> null%0A      - storage_encrypted               = true -> null%0A      - tags                            = {} -> null%0A      - tags_all                        = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - vpc_security_group_ids          = [%0A          - "sg-01de29cd9149d5d29",%0A        ] -> null%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be destroyed%0A  # (because aws_docdb_cluster_instance.docdb_instances is not in configuration)%0A  - resource "aws_docdb_cluster_instance" "docdb_instances" {%0A      - arn                          = "arn:aws:rds:eu-central-1:898587786287:db:staging-keyserver-keystore-docdb-primary-instance-0" -> null%0A      - auto_minor_version_upgrade   = true -> null%0A      - availability_zone            = "eu-central-1c" -> null%0A      - ca_cert_identifier           = "rds-ca-2019" -> null%0A      - cluster_identifier           = "staging-keyserver-keystore-docdb-primary-cluster" -> null%0A      - db_subnet_group_name         = "staging-keyserver-keystore-docdb-private-subnet-group" -> null%0A      - dbi_resource_id              = "db-GF34S7DWNQQBQUS4WCMKJKNQSA" -> null%0A      - endpoint                     = "staging-keyserver-keystore-docdb-primary-instance-0.cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> null%0A      - engine                       = "docdb" -> null%0A      - engine_version               = "5.0.0" -> null%0A      - id                           = "staging-keyserver-keystore-docdb-primary-instance-0" -> null%0A      - identifier                   = "staging-keyserver-keystore-docdb-primary-instance-0" -> null%0A      - instance_class               = "db.r6g.large" -> null%0A      - kms_key_id                   = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null%0A      - port                         = 27017 -> null%0A      - preferred_backup_window      = "22:12-22:42" -> null%0A      - preferred_maintenance_window = "fri:02:49-fri:03:19" -> null%0A      - promotion_tier               = 0 -> null%0A      - publicly_accessible          = false -> null%0A      - storage_encrypted            = true -> null%0A      - tags                         = {} -> null%0A      - tags_all                     = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - writer                       = true -> null%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be destroyed%0A  # (because aws_docdb_subnet_group.private_subnets is not in configuration)%0A  - resource "aws_docdb_subnet_group" "private_subnets" {%0A      - arn         = "arn:aws:rds:eu-central-1:898587786287:subgrp:staging-keyserver-keystore-docdb-private-subnet-group" -> null%0A      - description = "Managed by Terraform" -> null%0A      - id          = "staging-keyserver-keystore-docdb-private-subnet-group" -> null%0A      - name        = "staging-keyserver-keystore-docdb-private-subnet-group" -> null%0A      - subnet_ids  = [%0A          - "subnet-0851c91f1a82ece18",%0A          - "subnet-0f59998ee3eeb6b29",%0A          - "subnet-0fe665bde6c07d332",%0A        ] -> null%0A      - tags        = {} -> null%0A      - tags_all    = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A    }%0A%0A  # module.keystore_docdb.aws_kms_key.docdb_encryption will be destroyed%0A  # (because aws_kms_key.docdb_encryption is not in configuration)%0A  - resource "aws_kms_key" "docdb_encryption" {%0A      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null%0A      - bypass_policy_lockout_safety_check = false -> null%0A      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null%0A      - enable_key_rotation                = true -> null%0A      - id                                 = "49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null%0A      - is_enabled                         = true -> null%0A      - key_id                             = "49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> null%0A      - key_usage                          = "ENCRYPT_DECRYPT" -> null%0A      - multi_region                       = false -> null%0A      - policy                             = jsonencode(%0A            {%0A              - Id        = "key-default-1"%0A              - Statement = [%0A                  - {%0A                      - Action    = "kms:*"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::898587786287:root"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "Enable IAM User Permissions"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A    }%0A%0A  # module.keystore_docdb.aws_secretsmanager_secret.master_password will be destroyed%0A  # (because aws_secretsmanager_secret.master_password is not in configuration)%0A  - resource "aws_secretsmanager_secret" "master_password" {%0A      - arn                            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null%0A      - force_overwrite_replica_secret = false -> null%0A      - id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null%0A      - name                           = "staging-keyserver-keystore-docdb-master-password" -> null%0A      - recovery_window_in_days        = 30 -> null%0A      - rotation_enabled               = false -> null%0A      - tags                           = {} -> null%0A      - tags_all                       = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A    }%0A%0A  # module.keystore_docdb.aws_secretsmanager_secret_version.master_password will be destroyed%0A  # (because aws_secretsmanager_secret_version.master_password is not in configuration)%0A  - resource "aws_secretsmanager_secret_version" "master_password" {%0A      - arn            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null%0A      - id             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj|C675B0DF-31BB-43CE-AD7A-E7C161999EAB" -> null%0A      - secret_id      = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-T0pBKj" -> null%0A      - secret_string  = (sensitive value) -> null%0A      - version_id     = "C675B0DF-31BB-43CE-AD7A-E7C161999EAB" -> null%0A      - version_stages = [%0A          - "AWSCURRENT",%0A        ] -> null%0A    }%0A%0A  # module.keystore_docdb.aws_security_group.service_security_group will be destroyed%0A  # (because aws_security_group.service_security_group is not in configuration)%0A  - resource "aws_security_group" "service_security_group" {%0A      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01de29cd9149d5d29" -> null%0A      - description            = "Allow ingress from the application" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.0.0.0/16",%0A                ]%0A              - description      = "Allow outbound traffic from the DocDB cluster"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-01de29cd9149d5d29" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks    
...

```

</details>

*Action: `pull_request`*